cases/Validation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    

    bottom
    {
     //type  zeroGradient;
         type            fixedValue;
     value	       uniform (0 1e-12 0);
    }
    
    top
    {
       type  zeroGradient;
//type            fixedValue;
  //     value	       uniform (0 0 0);
    }

   
    left
    {
       type            cyclic;
    }
    right
    {
        type            cyclic;
    }
   
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
